backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
---
    def user_session
        User.find(session[:uid].to_i)