backend/app/controllers/donations_controller.rb

INSERT INTO "donations" ("amount", "name", "payment_method", "email", "home_detail_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create

        donation = Donation.create(donation_params)