backend/app/controllers/home_details_controller.rb

SELECT "home_details".* FROM "home_details"
---
    def index
        home = HomeDetail.all

INSERT INTO "home_details" ("name", "description", "image_url", "location", "address", "email", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
      home = HomeDetail.create(home_params)

      # user = User.find_by(id: session[:user_id])

      # if user && user.admin?
        if home.save

SELECT "home_details".* FROM "home_details" WHERE (location LIKE '%kitale%')
---
    def search
      if params[:name].present?
        homes = HomeDetail.where("name LIKE ?", "%#{params[:name]}%")

SELECT "home_details".* FROM "home_details" WHERE "home_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "home_details" SET "name" = $1, "description" = $2, "image_url" = $3, "address" = $4, "email" = $5, "phone_number" = $6, "updated_at" = $7 WHERE "home_details"."id" = $8
---
    def update
        home = HomeDetail.find(params[:id])

        if home.update(home_params)

SELECT "home_details".* FROM "home_details" WHERE "home_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "home_details" WHERE "home_details"."id" = $1  [["id", 1]]
---
    def destroy

        home = HomeDetail.find(params[:id])

        if home.destroy