backend/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "user_id", "home_detail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 5], ["comment", "ood"], ["user_id", 1], ["home_detail_id", 1], ["created_at", "2023-04-18 07:21:42.336764"], ["updated_at", "2023-04-18 07:21:42.336764"]]
---
    def create
        review = Review.create(review_params)

SELECT "reviews".* FROM "reviews"
---
    def index
       review = Review.all

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = $1, "comment" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["rating", 2], ["comment", "enjoyed te day"], ["updated_at", "2023-04-18 09:53:35.020793"], ["id", 2]]
---
    def update
        review = Review.find_by(id: params[:id])

        if review.update(review_params)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 4]]
---
    def destroy
        review = Review.find(params[:id])
        if review.destroy