backend/app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "username", "email", "admin", "password_digest", "reset_password_token", "reset_password_sent_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def register
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "doe@gmail.com"], ["LIMIT", 1]]
---
    def make_admin
        user = User.find_by(email: params[:email])

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "meme@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", false], ["updated_at", "2023-04-20 18:04:01.475794"], ["id", 47]]
---
      def remove_admin
        user = User.find_by(email: params[:email])
        if user&.admin?
          if user
            user.admin = false
            user.save