backend/app/controllers/visits_controller.rb

SELECT "home_details".* FROM "home_details" WHERE "home_details"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    home_detail = HomeDetail.find_by(id: params[:home_detail_id])